In [1]:
filepath='DataFiles/Income.csv'#defineing file location and assigned a name
import pandas as pd #imported pandas library as pd
def readCSVdata(filepath):
    return pd.read_csv(filepath) #reading csv file
readCSVdata(filepath)
#HEre what we did is to read data from a csv file and coverted it into a dta fram e usiong pands

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,6293,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [2]:
incomedf=readCSVdata(filepath) #reading csv file return ing data to incomedf file
def printDataFrameColumn(df):
    columns=df.columns #assigning columns
    for column in columns: #for all columns in data file
        print(column,end=' ') #print the data using space in it
    return
#from  above we print 1st column contents that we generated by using above incomedf 
printDataFrameColumn(incomedf)

GEOID State 2005 2006 2007 2008 2009 2010 2011 2012 2013

In [3]:
#for acesseing a row based on aunique column
def accessDataFrameRow(df,key):
    for row in df.values:
        if key in row:
            for item in row:
                print(item,end=' ')
    return
accessDataFrameRow(incomedf,39018)
#from above wecan accesess entire row based on the key which is given

04000US05 Arkansas 36658 37057 40795 39586 36538 38587 41302 39018 39919

In [4]:
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,6293,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [5]:
def getRowIndex(df,rowkey):
    for i in range(len(df.values)):
        if df.values[i][0]==rowkey or df.values[i][1]==rowkey:
            rowindex=i
    return rowindex
getRowIndex(incomedf,'Arkansas')
#above for getting row index from incomedf with coresponding to a keyword

3

In [6]:
def getColumnIndex(df, columnkey):
    for i in range(len(df.columns)):
        if df.columns[i] == columnkey:
            columnindex = i
    return columnindex
getColumnIndex(incomedf,'2009')
#above gives the column index of a data elements in in a given data

6

In [7]:
def valueFromRowColumn(df,rowkey,columnkey):
    rowindex=getRowIndex(df,rowkey)
    columnindex=getColumnIndex(df,columnkey)
    return df.values[rowindex][columnindex]
valueFromRowColumn(incomedf,'California','2009')
#above gives the elemnt by the reference of row and column element

56134

In [8]:
def updateCellFromRowColumn(df,rowkey,columnkey,newdata):
    rowindex=getRowIndex(df,rowkey)
    columnindex=getColumnIndex(df,columnkey)
    row=df.values[rowindex]
    row[columnindex]=newdata
    df.loc[rowindex]=row
    return
updateCellFromRowColumn(incomedf, 'Arizona', '2007', 47215)
incomedf
#above cand do edit already existed data

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [9]:
accessDataFrameRow(incomedf,62993)

04000US02 Alaska 55891 56418 62993 63989 61604 57848 57431 63648 61137

In [10]:
#function to write DataFrame to csv
incomedf.to_csv(filepath,index=False)

In [11]:
def addRowDataDataFrame(df,rowdata):
    lastrowindex=len(df.values)-1
    df.loc[lastrowindex+1]=rowdata
    return
rowdata=[1,2,3,4,5,6,7,8,9,10,11]
addRowDataDataFrame(incomedf,rowdata)

In [12]:
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528
5,1,2,3,4,5,6,7,8,9,10,11

In [13]:
#function to delete a row in dataframe
def deleteRowDataFrame(df,rowkey):
    rowindex=getRowIndex(df,rowkey)
    return df.drop(rowindex)
incomedf=deleteRowDataFrame(incomedf,1)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [14]:
def incomeAvg(df,states,startyear,endyear):
    a=accessDataFrameRow(df,states)
    b=a.split(' ')
    print(b)

In [15]:
incomeAvg(incomedf,'Alabama','2009','2015')

04000US01 Alabama 37150 37952 42212 44476 39980 40933 42590 43464 41381

AttributeError: 'NoneType' object has no attribute 'split'

In [ ]:
print(incomedf.columns[0])

In [ ]:
def averageStateWithBoundary(df,key):
    datas=df.values
    for data in datas:
        if data[1]==key:
            f=data[2:]
            return(sum(f)/len(f))
n=int(input())
li=list(map(str,input().split()))
pig=0
pigag=0
for  i in  range(n):
    #for i in li:
    pig+=averageStateWithBoundary(incomedf,li[i])
pigag=pig/n
print(pigag)

In [ ]:
averageStateWithBoundary(incomedf,'Alaska')

In [35]:

def lastthreeGreat(df,key):
    datas=df.values
    for i in datas:
        if key==i[1]:
            li=i[-3:]

    avg=sum(li)/len(li)
    return(avg)

dic={}
li=list(map(str,input().split()))
for i in li:
    dic[lastthreeGreat(incomedf,i)]=i
print(max(dic.items()))

Alaska
(60738.666666666664, 'Alaska')

In [60]:
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [34]:
lastthreeGreat(incomedf,'California')

55971.666666666664

In [ ]:
incomedf

In [ ]:
 lastthreeGreat(incomedf,'Alaska')

In [38]:
def minavggefor(df,key):
    avg=0
    dattas=df.values
    for i in dattas:
        li=i[4:8]
        #print(li)
    avg=(sum(li)/len(li))
    return(avg)
s=list(map(str,input().split()))
dic={}
for i in s:
    dic[minavggefor(incomedf,i)]=i

print(min(dic.items()))
    

minavggefor(incomedf,'Alaska')

Alaska
(55791.25, 'Alaska')

55791.25

In [70]:
def pri(df):
    data=df.values
    dic={}
    for i in data:
        li=i[2:]
        dic[i[1]]=sum(li)/len(li)
    print(dic)
    a=dic['California']
    for item in dic.items():
        if item[1]<a:
            print(item[0],end=' ')
pri(incomedf)

{'Alabama': 41126.444444444445, 'Alaska': 60106.555555555555, 'Arizona': 47214.77777777778, 'Arkansas': 38828.88888888889, 'California': 55350.444444444445}
Alabama Arizona Arkansas

In [80]:
def sort2000(df):
    data=df.values
    dic={}
    for i in data:
        dic[i[6]]=i[1]
    dic=sorted(dic.items(),reverse=True)
    print(dic)
sort2000(incomedf)

[(61604, 'Alaska'), (56134, 'California'), (45739, 'Arizona'), (39980, 'Alabama'), (36538, 'Arkansas')]